[
  {
    "podcast_id": "yt-xXVB8A5xvSw",
    "transcript": "Is it possible to gain muscle while at the same time losing fat? Yes. Does it require a caloric deficit? This is the weird part, no. No. He collected all the studies that witnessed this recomposition phenomenon, you know, with simultaneous gain in lean mass and loss in fat mass, which we didn't necessarily think was possible like 10 years ago. I'd like to talk a little bit about body recomposition. It's a simple question to start off. Is it possible to gain muscle while at the same time losing fat? Yes. Great, that will be reassuring to people. Does it require a caloric deficit? This is the weird part, no. No. Just super interesting, man. My friend and colleague, Chris Barakat, he collected all the studies that witnessed this recomposition phenomenon with a recomposition, we call it recomp, you know, with simultaneous gain in lean mass and loss in fat mass. So he collected all the studies. He collected 10 studies. This review was put out five years ago. So you can imagine there's probably a few more studies that have shown recomp now. So we can say at least a dozen studies have shown this phenomenon, which we didn't necessarily think was possible like 10 years ago. You know, we thought, okay, you need a caloric surplus to gain muscle and you need a caloric deficit to lose fat. But what happened in these studies is the recomposition phenomenon is, I think seven out of the 10 studies was a lean mass gain dominant recomposition. So in other words, more lean mass was gained than fat was lost. So there were net gains in body mass by the end of these trials, which would at least very strongly imply that fat was lost in a caloric surplus. If you were going to suggest to somebody the best way to approach this, let's say somebody, loosely speaking, this is not a competitive athlete. This could be a man or a woman, assuming that the same advice would pertain to both, is willing to do resistance training three to four times per week. Let's say three times per week. Do some cardio three times per week for about an hour each session for those. And they are willing to eat maintenance calories or slightly over. And their goal is to gain some muscle and lose some fat. Where would you set the calories relative to their needs? Would it be an extra two to 500 calories? I realize that's hard to say because we should talk in percentages, but let's just keep it broad for sake of a broad audience. How much more than maintenance should somebody ingest? And let's assume that when they go in the gym, they know what they're doing. They warm up for five, 10 minutes, and then they train hard. They take the sets close to failure. They're doing three to six sets per body part. They're training with meaningful effort. And when they do their cardio, they're somewhere between zone two, and maybe they throw in a max heart rate workout once a week. They do some sprints in the middle of their zone too, and go back to, you know. This, I think, is pretty typical of what a lot of people are willing to do or currently doing. I would say sort of the simple and direct answer is to try to keep the caloric surplus pretty judicious. So 10%-ish above maintenance conditions, which could be for somewhere between 200, possibly 300 calories above what you see as maintenance. And the common thread amongst these recomposition studies was that protein was very high. Protein was somewhere between a gram to a gram and a half per pound of body weight. Interesting. So now we've upped the protein intake. Yes. Could we even say that the caloric, this 10% above maintenance, should come from quality protein? Exactly. Yes, yes. There's a series of studies done by Joey Antonio and colleagues where they fed the subjects four to 800 calories above and beyond their habitual intakes, just in protein. And either recomposition happened or no significant change in body composition happened. Were they training? They were training. They were resistance training. And so what protein apparently does when you consume very high amounts of it, up to a gram, a gram and a half per pound of body weight, is it just sort of spontaneously does the magical things. It'll drive down your intake of the other macros. It will potentially increase your exercise energy expenditure and or your non-exercise energy expenditure. It will do odd things. Like I talked to Joey Antonio when he got some feedback from the subjects on his very high protein study where he subjected them to two grams per pound for an eight week period. And he had subjects come into him saying, hey, I'm like sweating while I'm sleeping. When you say two grams of protein per pound of body weight, are we talking about increasing total caloric intake or just using more of one's daily caloric needs, devoting more of that to quality protein? See, that's the super interesting and kind of mysterious part. They're literally saying, okay, maintain your usual dietary habits and then just add 50 to 100 grams of protein on top. So you're eating an extra chicken breast and a couple of scoops of whey protein or maybe some eggs as well. And you're just adding more quality protein on top of what you're already eating. And we already learned that we can distribute that pretty much wherever we want. Just do what's most comfortable for you relative to your training and other needs. And you're saying then, but they're sweating in their sleep. They're sweating in their sleep, that extra 80 to 100 grams of protein, just add it. And look, it's a free living study. So we're not surveilling people in a metabolic ward. So the increase in protein could have translated to greater energy expenditure through a number of pathways, non-exercise pathways or exercise pathways. It could put more power to the ground during their training. It could have been some sort of some magic thermic stuff going on, who knows. But, and also we can't discount the fact that when you're telling people to add, let's say 80 or 100 grams of protein to their habitual intake. The weird thing about subjects self-reporting is they tend to over-report the healthy stuff that you assign them and under-report the unhealthy stuff. The good pupil phenomenon. Yeah, yeah, exactly, exactly. And so there could be some misreporting going on there, but over a series of like five-ish studies now, just stack the protein on top, nobody gains fat. And some people lose fat. Awesome. Yeah, it is pretty freaking awesome. Now here's the thing that needs to be said. Okay, so there was a metabolic ward study done in 2013-ish by Bray and colleagues where they subjected the participants to escalating amounts of protein. And it was a protein overfeeding study. There were three levels of protein intakes. There was 5% protein diet, a 15% protein diet and a 30-ish percent protein diet. The calories, the total calories escalated too. There was no exercise involved with this metabolic ward study. And the subjects gained both lean mass and fat mass with the escalating protein amounts. So there's different stuff going on when you lock people up in a metabolic ward and they can't train and then you're escalating their protein intakes and calories, they will gain fat and lean mass. But in free living conditions with resistance training, if you just over protein the subjects, they actually have a tendency to lose fat. And it's a really interesting phenomenon because it's been seen repeatedly. With men and women? With men and women, yes. The message I'm getting is, if you're going to add calories, add quality protein. Make sure your resistance training, here I'm building on the previous things we talked about, the distribution of the protein probably doesn't matter as much as just getting the total protein correct. And I find it very reassuring that I can train fasted or not fasted, mostly because very few of us have total control of our schedule. So sometimes we need to train first thing in the morning and we got to catch a flight or head to work. Sometimes people only have time in the evening, this kind of thing.",
    "created_at": "2025-09-24T18:47:08.988246+00:00"
  },
  {
    "podcast_id": "yt-928aRhhPP8I",
    "transcript": "This is the upper body workout that I used for the last 365 days, and it transformed my physique. It took my back from looking like this to this, and my chest and shoulders from looking like this to this. And even after 15 years of natural training, I still managed to gain 2.7 pounds of lean mass measured by DEXA, and I even added some extra peak to my biceps measured by ultrasound. In this video, I'll show you the exact exercises and technique cues that made the biggest difference for me this year. Let's get into it. I think this was hands down the most effective exercise for growing my pecs this year. The incline barbell bench press. It mostly targets the chest and front delts with some bonus triceps and even side delt activation since the side delts help stabilize the bar from drifting forward or backward. I picked the incline barbell press over the incline dumbbell press because of the barbell's overload potential. I ran this program for a full year, and while dumbbells are great, once you get pretty strong, they become big, bulky, and awkward. But you can always add a little weight to the barbell. And while I am a fan of the Smith machine, I went with free weights here to get more out of the stabilizing muscles, especially those side delts. There's a growing trend of only doing the most stable, machine-based version of lifts, but I think that's gone a bit too far. Even for pure hypertrophy, free weight compound lifts still have a lot of value. And research backs this up. An incline barbell bench press clearly grows your chest. In fact, a 45 degree incline press will hit your upper pecs harder while still hitting your mid and lower pecs just as hard as a flat bench. This study from Chavez and colleagues found that the incline press grew the mid and lower pecs just as well as a flat bench, but the incline press had that added bonus of growing the upper pecs more. The incline press is also very time efficient because it kills two birds with one stone. You really don't need both a flat press and a vertical press if you just meet in the middle with a 45 degree incline. Now, the main technique cue that I focused on this year was using a slightly narrower grip to increase the range of motion, and that'll hit a bit more triceps without losing chest tension. And of course, I took the last set to absolute failure every time. I never use a spotter to help me get the weight up, I wanted to give it my all this year and then just fail on my own accord for scientific consistency. Failing on a heavy compound lift can be a bit intimidating at first, even for experienced lifters, but there's really nothing to be scared of. Just press until you can't press anymore, and then dump the weight forward onto the safety bars. Now, the most common mistake I see here is bouncing the bar off your chest. Yes, you can lift more weight this way, but remember, progressive overload is when you add a little weight or a rep from week to week, and that only counts if your technique stays consistent. So, control the descent, do a slight pause on your chest, and then press the weight up and slightly back. Okay, next is where I slow things down a little bit more and put all the tension exactly where I want it, on the pecs. The seated cable fly will also stretch the pecs more than the heavy compound press that we did first. For these, set a bench pretty far out in front, grab both handles, hold them tight to your chest, and walk out in front of the bench. As you sit down, you don't want to get pulled backward, so ease yourself into the seat. Then press the handles forward into the starting position, and from there, begin your first rep with a nice and controlled negative. Try to get as deep as your shoulders will comfortably allow, and then squeeze the weight forward using your pecs. Try to focus on bringing your elbows together, not just your hands. This will keep tension on your chest and prevent your triceps and front delts from taking over. From there, sweep the weight out and back in an arc, not just back. So, try to think about covering as much space as possible as you do the negative. Now, I picked these over a pec deck because I do find I can get a bit deeper here than most pec decks allow, and I do them seated over standing, because if you're seated, you'll be a bit more stable, which means no tension coming from the weight stack is being lost to my ankles or my low back, which will have to do some stabilization when I'm standing. Remember, our goal here is pure pectoral isolation. Now, the most common mistake I see here is letting your elbows drop. This puts your pecs at a mechanical disadvantage and worsens the line of pull for the pec fibers. So, keep your elbows up and think about hugging a big tree as you fly forward, then sweep the weight out in a wide arc on the negative, and again, last set to failure, no exceptions. I think the biggest gains I made this year were in my back, and I owe a lot of that to one exercise, weighted pull-ups. I know I infamously put these in A-tier instead of S-tier last year, but after this 365-day experiment, I'm officially promoting pull-ups to S-tier. Pull-ups light up your entire back, your lats handle the shoulder extension, your mid traps and rhomboids will light up during scapular retraction, and your low back will engage for stabilization. Your biceps and brachialis will take care of elbow flexion, and there's also going to be some muscle activation in your core, since you aren't seated like in a lat pull-down. Now, I went with a pull-up over a lat pull-down, mainly because I think they're harder, and I didn't want to shy away from the more challenging exercises this year. I'm also focusing a lot on progressive overload for this experiment, and I find that with lat pull-downs, once you get strong enough, it just becomes near impossible to avoid swinging back and forth. However, with pull-ups, you are more limited in how much you can swing and sway, especially once you get some weight strapped to you, and especially if you do a pause in the bottom of each rep. I'm not saying pull-ups are better than pull-downs, they each have their strengths, but yes, I attribute most of my back growth this year to doing a lot of weighted pull-ups. Two simple technique cues. Think about getting your chest to the bar, rather than just getting your chin over the bar. This will help you stay in control of the movement better. And then, this may sound obvious, but as you pull, you want to think about pulling with your back, rather than with your arms. Your arms are just connectors, so instead of pulling with your arms, think about driving your elbows down and in. This will activate your lats and prevent your biceps from taking over. I also use both liquid chalk and straps on these, so my grip doesn't limit my back gains. And for the experiment, I used this grip in between a fully pronated wide grip and a neutral grip. I just find it a little more comfortable on my shoulders, but they all work. A very common mistake here is, oddly enough, when people worry too much about feeling their lats. Pull-ups aren't a feely exercise. They're not really supposed to feel amazing. They're supposed to get you jacked and strong. So, pull yourself up, and then lower yourself back down under control. Increase the weight you're pulling over time, and if you do that, your lats are going to grow, whether you feel them or not. So, when I started this experiment, I did 30 pounds for six reps on day one, and now I just did 60 pounds for six reps. And that's just straight progressive overload. Pretty happy with that. And yes, that was my last set, so taken to failure, as always. If you can't do weighted pull-ups yet, no problem. Just start with assisted pull-ups. You can use a band or a machine and gradually reduce the assistance. Eccentric-only pull-ups are also a great progression tool. Just use a box so you can start at the top of the range of motion, and then lower yourself down slowly and repeat. My side delts also definitely improved throughout the course of this experiment, and I attribute most of that to this exercise right here. High cable lateral raises. Just two or three sets of eight to ten reps, but I push those sets hard. When done right, these almost exclusively target the side delts, which are arguably the most important muscle fibers for creating that wide, tapered x-raying look. And I use cables here because they provide consistent tension throughout the range of motion, unlike dumbbells, where there's no tension at the bottom and peak tension only kicks in at the very top. Also, by setting the cable higher, you'll make the movement hardest when your delts are most stretched. Yeah, I do think the importance of the stretch was slightly exaggerated on social media for a while, but it's still true that with cables, peak tension always occurs when there's a 90 degree angle between your arm and the cable, and that happens early in the range of motion when the pulley is set high. Now, a study published just this past December compared cable lateral raises to dumbbell lateral raises. The study we've all been waiting for, at least I was. Each subject trained one arm with cables and the other arm with dumbbells twice a week, five sets per session, all sets to failure. After eight weeks of training, they found that both exercises grew the side delts about the same. So, if you don't have access to cables, the good news is dumbbells still get the job done. That said, this study didn't have their subjects perform cable lateral raises quite the way I do them. They stopped their range of motion directly at their side, which I'd argue means they were missing out on one of the main potential benefits of using a cable, which is that extra range of motion you get by sweeping the weight across your body. Still, based on this new data, I doubt cables versus dumbbells is a true game changer. What matters most is choosing a variation where you can feel your side delts working and pushing that variation hard with good form. I still use both, cables on my upper body day and dumbbells on my push day. And of course, last set goes to failure. Now, by far the most common lateral raise mistake is shrugging the weight up. This will cause your upper traps to take over and rob your side delts of tension. Instead, focus on sweeping the weight out rather than lifting it up. If you're struggling to get a feel for this, stand up against a wall and push your arm out sideways against the back of your forearm. Apply pressure gradually against the wall and you should feel your side delts really turn on. That's the exact intention you should be using on your lateral raises. Think out, not up. This next exercise will activate every single muscle fiber in your entire back, from your neck down to your hips. It's the deficit pendlay row, and if you're not doing it, I genuinely think you're missing out. You get amazing mid-trap engagement from the scapular retraction, high levels of upper and lower trap activation from scapular stabilization, solid lat activation from shoulder extension, and your spinal erectors will light up since they have to fire isometrically throughout the entire set to keep you locked in that horizontal position. By standing on a bumper plate, you'll increase the range of motion, giving your lats a deeper stretch at the bottom than a traditional floor level pendlay row. I also tweak the execution for hypertrophy. Instead of the typical explosive up, drop down style, I keep the explosive positive, but slow down the negative to maintain eccentric tension and control. Then, on the last set, I push beyond failure by using lengthened partials. Yes, I still do these on some exercises, so when I can't get that full squeeze at the top, I still grind out another three or four reps in the stretch position where the lats are the strongest. I know some of you are sick of lengthened partials, but this is a spot where they really make sense, especially given the lat strength curve. Now, the biggest mistake here is just not getting fully horizontal. Being more upright isn't necessarily wrong, but when your torso is parallel to the floor, gravity is pulling directly against your scapular retractors. This forces your mid traps and rhomboids to work much harder. The only way to make a traditional higher torso angle row hit the same is by compensating with more weight, but pound for pound, pendlay rows are simply more challenging, so I didn't shy away from them this year. Also, make sure you use straps or, at the very least, chalk. If you're letting grip hold you back here, you're definitely leaving back gains on the table. Last set to failure. For triceps, I'm using what current research shows is likely the single most effective movement, not just for the long head, but for all three heads. The cable overhead triceps extension. This study compared overhead extensions to push downs and found that overhead extensions caused 50% more growth in the long head, 40% more growth in the lateral and medial heads, and 40% more growth in the triceps overall. It's a killer. If I only have time for one triceps exercise, this is the one. Now, the most common mistake here actually happens before the set even starts during the setup. Most people set the cable way too low and waste a bunch of energy trying to spin and twist themselves into position. Instead, just move the cable up higher, squat underneath it, and use your legs to lift the weight up into place. Then take a step or two forward and you're ready to go. No wasted energy. Failure. Alright, biceps. This part's super cool because a few new studies on biceps growth just dropped. And wouldn't you know it, there's even one comparing my personal favorite, the Bayesian cable curl, to the classic preacher curl. The results? Well, there were non-significant trends favoring the Bayesian curl, but nothing statistically significant. That could be because the study was underpowered, it only had 15 subjects and it ran for just 10 weeks, or it could mean that both exercises grow your biceps equally well. Regardless, on my upper body day, I've been doing Bayesian curls, because based on the totality of the evidence, I still suspect they have a slight edge, especially thanks to that deadly combo of long muscle length and high tension in that lengthened position. Failure. But to be sure, on my pull day, where I train biceps again, I do preacher curls and hammer curls. Failure. Failure. Now, if you want my full upper lower push pull legs program, it's available now at jeffnippard.com. I'll link it down below, and I'll also put a discount code in the description box just for YouTube, so you can save 25%. Also, thanks for all the love on the last video. My brother and I went through the comments, and we were blown away by all the support and love. We both really, really appreciate it. We've also both started experiment number two, so make sure you subscribe so you don't miss what's coming next. Alright, thanks for watching, guys. I'll see you all here in the next one.",
    "created_at": "2025-12-17T21:31:44.517826+00:00"
  },
  {
    "podcast_id": "yt-DzjWEn2BS_k",
    "transcript": "For the last 100 days, I cut all my workouts in half. I wanted to see what would happen if I went from doing my usual 3-4 sets per exercise down to just one all-out set, sometimes two. Would I lose muscle? Well, in this video, I'll break down exactly what I did, what the science says, and what happened to my physique. For as long as I've been training, I've always been a pretty high-volume guy. For one, that's the way the bodybuilding greats like Arnold, Ronnie Coleman, and Jay Cutler all trained, and it's also what the science suggested was most optimal. So for me, it was kind of a no-brainer. I generally do at least 3-4 sets on each and every exercise, every workout. But like I said, for the last 100 days, I flipped that completely. I became the lowest-volume guy in the gym. Instead of 3-4 sets, I only did 1 or 2 sets per exercise. That's it. For several lifts, I'd just do one all-out, max-effort set and move on. Now, to get everyone on the same page, when I say volume, I mean the total number of hard-working sets that you do for a muscle each week. So if you do a large number of sets, you're doing a high-volume program. If you do a small number of sets, you're doing a low-volume program. So let's use our chest as an example. Let's say you hit your chest on two days, three sets of chest press on Monday and three sets of cable flys on Thursday. And that's all you do for the week. That means your weekly chest volume is 6 sets per week. And for the last decade or so, the standard science-based guideline for sets per muscle per week was, what do you think? It's about 10-20 sets per muscle per week. That's quite a lot. Going with our chest example, the low end of the science-based range at 10 sets would look like this. Three sets of chest press plus three sets of cable flys on Monday and four sets of push-ups on Thursday. And the high end of the science-based range at 20 sets would look like this. Four sets of chest press and four sets of cable flys on Monday, three sets of push-ups and three sets of pec deck on Wednesday, three sets of incline press and three sets of dumbbell flys on Friday. That's a lot of chest and that doesn't include warm-up sets. These are all hard-working sets all the way to failure or very close to it. And of course, that's just for one muscle. For your total body volume, you need to add up all the sets for all your other muscles too. Those are some long workouts. Trust me, I trained like this for years, but not anymore. This is what my full week of chest training looks like now. Two sets of incline press and two sets of pec deck on Monday, two sets of machine chest press on Thursday. That's it. Six sets per week. Let's use this graph to compare how my current volumes look compared to the standard science-based volumes. This is what the high end of the science range looks like. And this is what the low end of the science range looks like. And this is what I'm doing right now. So it's pretty freaking low across the board. Most of my muscles get six sets per week. Some get four sets per week. And if you are in the eight to 10 range, my shoulders get 10 sets, my back gets nine, my glutes get nine, and my quads get eight. On average, I'm only doing about six and a half sets per muscle per week. And for the 100 day experiment, I split that volume up like this, upper, lower rest, upper, lower arms rest. And I repeated that split for 14 weeks. The thing is on paper, by following this plan, I was training at a level of volume that most experts would say is too low to maximize muscle growth. For the past 15 years, the research has been hammering the same message. Volume is king. Back in 2010, James Krieger published a meta-analysis of eight studies comparing one set versus two to three sets per exercise. And what he found was clear. Doing more sets caused more gains. Two to three sets per exercise was about 40% more effective than just doing one set. And over the next six years, at least another seven studies on volume and hypertrophy were published. So in 2016, Krieger and colleagues dropped another meta-analysis. This time, rather than sets per exercise, they looked at sets per muscle per week, and they found a clear dose response effect. Once again, more volume meant more gains. By this point, volume had pretty much cemented itself as the main driver of hypertrophy within the science-based community. I was even singing its praises. Training volume, this has been cited as being the main driver of hypertrophy. But were we all kind of wrong? Well, last year, Pelland and colleagues dropped the biggest, most detailed meta-analysis on training volume that's ever been published by far. Now we're up from 15 to, get this, 35 studies on training volume for muscle growth. And this time, yeah, they found another super clear dose-response relationship between volume and hypertrophy. More volume, more gains. And that trend held from as low as four sets per muscle per week all the way up to 43 sets per muscle per week. Even the authors were kind of like, man, I don't know what to tell you. Doing a lot of volume just really seems to work. But there are some issues. If you venture deep into the dingy underground corners of the online science-based lifting subculture, you'll find plenty of people criticizing this paper. You'll hear that none of these studies are actually measuring true muscle growth. What's really happening is all that high volume training is simply causing the muscle to swell up with blood and inflammation, something called edema. It's really just a big pump that lasts a few days, making it look like the subjects gained more muscle when the researchers measured it. There's probably some truth to this, but it's not the angle I'm taking. I think the overall effect is just too big across too many studies. It's more than just edema gains. Plus, the authors address this in the paper itself. No. Instead, I'm going to criticize this literature through a much more practical lens. First, let's get this straight. These studies didn't apply high volumes to every muscle all at once. No. Most of them just blasted their biceps and triceps or their quads with high volumes. And for the most part, all their other muscles were trained normally or not at all. So the best you can really say is that high volume works if you blast a single muscle or two. Even the authors note that doing high volume for your entire body could cause some serious recovery issues. Speaking of recovery, almost all of these studies were done at around maintenance calories. But what happens if you're in a caloric deficit like I am right now? A deficit means less energy, which means less recovery. So it's just not clear if these results apply when you're cutting. This is a crucial point that I'll come back to when I show you my fat loss results throughout this low volume experiment. Perhaps most importantly, though, all of these studies are short-term interventions. They usually only last 6 to 12 weeks. So what happens over a longer time frame, like a year or two? Do higher volumes keep pulling you ahead forever or do they just give you a short-term boost and lower volume training would eventually catch up as you get closer and closer to your natural limit? Based on this research, we can't really say because they don't last long enough. And then there's this whole thing with diminishing returns in general. On the surface, all these studies can definitely make it feel like doing exponentially more volume will get you exponentially more gains, but that isn't how it works at all. The extra muscle growth that you get by doing more and more volume gets smaller and smaller. All of that is why I wanted to test this out for myself. Was I doing all this volume just based on some bodybuilding anecdotes from guys 100 pounds bigger than me and some science that, while valid, has some serious practical limitations? My N equals 1 experiment lasted for 100 days, which is longer than almost all of these studies I've shown you so far. I tracked my chest strength and my quad strength using a standardized, science-based protocol. I tracked my physique with progress photos under the exact same lighting, and I tracked my body fat and lean mass with DEXA. For the challenge, I wrote the most effective low-volume split I could think of. Upper, lower, rest. Upper, lower, arms and delts, rest. And just one to two sets per exercise, with almost every set taken to failure. I knew from other research that if I was going low on volume, I needed to go ultra high on intensity. Now, I'll be honest, I did have some doubts, especially in those first few weeks. After years and years of doing 10-20 sets per muscle per week, it did feel like I wasn't doing enough. But by around week 3, I noticed something surprising. Not only was I not losing size, I actually looked harder and fuller. I was noticing more vascularity, too. That's probably because I was getting leaner, but the lower-volume training was still keeping my muscles fuller than what I expected. And most importantly to me, despite steadily losing weight, I was keeping my strength up on all my lifts. And that's probably the best indicator that I was keeping my muscle. After the first month was up, I started to think that maybe I just didn't need as much volume as I used to think, as long as I was pushing really hard. The research does show, for the most part, that on average, higher-volume training does lead to more muscle growth. However, I do think on a cut, a low-volume program can make more sense, and that's because you have a lower recovery capacity, and so a high-volume training program can just be harder to recover from. So yeah, if you're doing a bulk or a recomp or whatever, high-volume training works great. I think it makes perfect sense. But when you're on a cut, I think a lower-volume program with really high intensity is a smarter approach, and that's what we're doing. But maybe I'm getting ahead of myself. One month isn't that much to go by, and new programs are always fun at first anyway. Plus, if it turns out that I lose a bunch of muscle by the 100-day check-in, I might change my tune. By the midway point, I started to feel like all that extra volume that I used to do was depleting me more than I realized. I actually think it was holding me back in some ways, because training is supposed to be fun. And I'll tell you, I used to dread doing some of those super high-volume workouts, especially leg days, and especially when cutting. Nowadays, for my leg workout, I hit two sets of squats, two sets of leg curls, one set of lunges, two sets of leg extensions, one set of abductions, and two sets of calves. It's not nothing, it's still a hard workout, but it only takes me about 45, maybe 60 minutes if I take my time, and I absolutely love it. I'm also more locked in than ever before. I don't know if it's some of my ADHD tendencies, but during almost every single high-volume workout I used to do, my focus would always start to taper off near the middle. I'd go on my phone more, I'd rest a little longer in between sets, and just start socializing. An already long workout would drag on even more. And this is where a low-volume training style really shines. It's what I've been calling the focus effect. When you know you only have one or two sets to get the job done, you will lock in. Before every set, I remind myself that I need to nail my execution and my effort. And because of that, I don't think there's been a single set where I didn't bring the intensity for this entire challenge. But I don't want you to just take my word for it. After all, this challenge only has one subject, and I haven't even shown you my results yet. And even if they are amazing, you shouldn't base too much of your own training off of one person's experience. That's why I want to take a second look at the science. Because while on the surface it really can look like volume is king, there is more support for a lower-volume training approach than you'd think, at least in the right context. For example, there's a lot of data showing that you need way less volume to maintain muscle than you need to build muscle. This classic study from Bickel and colleagues had subjects run two phases back-to-back, a high-volume phase and a low-volume phase. For the high-volume phase, they hit their legs three days a week. Each workout had three sets of squats, three sets of leg press, and three sets of leg extensions. That's 27 sets per week just for their quads. And they did that for 16 weeks. Then, half the subjects entered a super low-volume phase where they dropped their workload down to, get this, one set for each exercise once a week. That means they went from 27 sets down to three. And guess what happened to their gains? They maintained 100% of their size and strength for another 16 weeks. Oh, and then another 16 weeks after that. They maintained their gains for 32 weeks. That's 224 days doing just one set per exercise, three sets total a week. That's it. And there were 70 subjects in that study. Some of them actually kept making gains during the low- volume phase. And to really drive this home, a brand new low-volume study from September of this year, so just last month, was just published. In this paper, Herman and colleagues had 42 resistance-trained subjects run a low-volume program, two full-body workouts per week with just one set per exercise. Each workout took about 30 minutes. They split everyone doing that low-volume program into a failure group and a non-failure group. The failure group, obviously, went to failure. The non-failure group left two reps in reserve. Other than that, both groups were following that 30-minute workout twice a week low-volume plan. And after eight weeks of one set per exercise per workout, both groups made significant gains. The failure group tended to grow better overall, though. So this new study tells us two really important things. First, on a low-volume program, going to failure seems to work better. And perhaps more importantly, it tells us that even experienced trainees can make gains on a low-volume program. Volume might not be the king that we thought. At least, that's what I make of this 2023 meta-analysis from Robinson and colleagues, which very clearly showed that the closer you train to failure, the more muscle you gain. To me, if any one variable should wear the crown, it should probably be training hard, right? And with low-volume training, since you're only doing a small handful of sets, you can afford to push nearly every single set to failure without hurting your recovery. If you tried to do that on a higher-volume plan, the fatigue and injury risk would eventually start to outweigh any marginal benefits. So after 100 days of low-volume workouts, what happened? Did it work? Well, this is what I looked like at the beginning of the challenge. And this is what I look like now, after 100 days of low-volume training. I was cutting during this experiment, so I am clearly leaner now. But I also think I look more jacked, especially in my legs and my shoulders. And despite being about 7 pounds lighter in the after, I think I held on to my muscle fullness, size, and density really well. And my DEXA supports that too. From day one to day 100, I lost 5.5 pounds of fat mass and 1.8 pounds of lean mass. I think that's a really solid ratio, especially when you consider that lean mass isn't only muscle mass. It also includes any water that I lost during the cut. And at my training age, you always lose some water as you shred down. But the crazy thing is, I think my results are even better than that implies. Because throughout this challenge, I got three DEXA scans. One done on day one, another on day 30, and a final check-in on day 100. From day 30 to day 100, so across 70 days of low-volume training, I actually gained half a pound of lean mass, while losing another 2.3 pounds of fat mass. That lean mass change could be within the margin of error, but it was still pretty encouraging to see. I also gained strength. Even in the very last week of my cut, when my macros were the lowest, I was hitting new PRs on the pendulum squat. I did five reps with five plates two weeks ago. Six reps with five plates last week. Seven reps with five plates this week. And my weight is going down. It's so insane how much better you lock in when you only have two sets to do. If I knew I had like four sets on that, I would be dragging my feet 100%. The fact that I know I've only got two, bro, I lock in and go crazy. Yeah. And I even hit a huge new PR on the chest press machine in the final upper body workout of the experiment. Dude, that's three reps. Four reps. More than my previous PR. That's actually nuts. On the check-in days, we also tested my max strength on the Smith machine bench press and the leg extension under a strict fasted protocol. After 100 days, I matched my bench press strength and I added 15 pounds to my leg extension max. That may not sound like much, but considering that I lost seven pounds, I'm already very advanced, and I was actually doing really low volume compared to my baseline. I think that's super solid. And I'll link the raw data for the DEXA and my strength tests down below as well. I think my progress updates show a clear picture too. Much more definition in my lower half, more pop in my shoulders and more shape in my arms. The biggest surprise for me though, was just how good the workouts felt. This variable is becoming more and more important to me at 34 and almost two decades deep into training. Instead of dreading long workouts, now I actually can't wait to train each day. And this challenge did cause me to change my mind on something pretty big. If you've been following me for a while, you might remember that I used to say that your training volume shouldn't change just because you start cutting. How do training requirements change when you go from a caloric surplus to a caloric deficit? And I think the answer is actually quite simple. It doesn't. But after doing this challenge, I want to update that. If you're cutting, I think low volume is the way to go. High volume will still work, but I don't think it's ideal since your recovery is lower in a deficit and low volumes retain muscle just fine as long as you're training hard. If you're bulking, I honestly think the best approach might be to keep your volume relatively low for every muscle, except one. Blast one muscle with 10 to 20, maybe even 30 sets per week at a time. And then every few months, you can rotate which muscle you're blasting. I think this makes a lot of sense, especially as you get more advanced. And I think once I start to lean bulk again, this is probably what I'll do. And now that I've got the muscle lab, I'll make sure that I document all that progress and keep you guys posted on how it goes. In the meantime, if you're looking for a low volume, high intensity program like the one that I ran during this challenge, you can get my brand new Min Max program over at JeffNipper.com and it's 25% off for launch week. In case you're watching this after launch week, I'll go ahead and put a discount code in the description box down below so you can still save some money. Research shows that one of the most common reasons that people skip the gym is lack of time. And the low volume workouts in the Min Max program are shorter, easier to stick to, more enjoyable, and easier to recover from. This is my favorite program that I've ever released. It comes with over 90 brand new exercise demos filmed in the new muscle lab, a full 12 week program with exercise substitutions in case there's any exercise you can't do, coaching notes from me, and a full ebook explaining all the science behind the program. It's suitable for all experience levels, but if you're a complete beginner just starting the gym, I'd suggest running through my Fundamentals program first. If you're aiming to lose fat right now, this is absolutely the best training program I could recommend to you. And if your main goal is to build muscle, I think this is the perfect plan as long as you want shorter, more intense, and more time efficient workouts, or if you just like to experiment with low volume training for yourself. Also, if you haven't already, make sure you download a free trial of Macrofactor, which is my smart nutrition app. Your diet is also super important for building your best physique, and it's the thing that most people miss. All right, that's it for this one, guys. Don't forget to leave me a thumbs up if you enjoyed the video, subscribe if you haven't already, and I'll see you all here in the next one.",
    "created_at": "2025-12-17T21:31:44.575928+00:00"
  },
  {
    "podcast_id": "yt-j1bx0GMofYw",
    "transcript": "Do you expect your muscles to grow bigger and bigger by shoveling high protein into your body? But what if eating more protein isn't just unnecessary but actually makes it harder to grow? Today I'll walk you through the new research that challenges everything we thought we knew and reveal the two things that actually build more muscle than protein. But how did protein become known as the most important nutrient in the first place? I mean there was some diets, I'm not gonna lie, ate 140 egg whites a day. People think it's crazy that I've eaten 200 grams of protein for almost 20 straight years. When you lift weights, you trigger muscle protein synthesis, a molecular message to muscles that says build. But building muscle is just like building a brick house. Without bricks, nothing gets built. Protein is those bricks. Eat enough of it and you've got the raw materials to actually turn that growth signal into new muscle. But when gym bros learned this, they didn't just want to build houses, they wanted mansions. Back in the golden era, it wasn't uncommon for bodybuilders to eat over 300 grams of protein per day, a dozen eggs in one sitting, and pounds of chicken breast. Fast forward to today and you'll still find lifters chasing 200 plus grams of protein per day or following the one gram per pound of body weight rule like it's gospel. I know I did. I used to believe that if I didn't hit my daily protein target, I was leaving tons of gains on the table. But it wasn't just bodybuilders. The food industry realized that they could cash in on this obsession. Suddenly, you've got protein cereal, protein chips, protein cookies, even Starbucks lattes with extra protein. Most of it is just cheap protein sprinkled in. But because they can slap high protein on the label, they charge you 20% more and people will happily pay for it. But here is where things get really interesting. Recently, a group of top protein researchers were curious about just how much extra muscle you build by eating more protein. So they got together and they gathered every long-term growth study they could find. 62 in total, where participants lifted weights but ate different amounts of protein. Then they plotted all those results on a graph. Protein intake on the bottom, muscle growth on the side. The results were not what they were expecting. In one study, participants ate what most lifters would call low protein. So 0.45 grams per pound of body weight. For someone who weighs 180 pounds, that's just 82 grams of protein a day. Basically, two chicken breasts. This mark on the y-axis represents how much growth they got. Now, what happens if you take a similar group of lifters, but you feed them double that? Four chicken breasts per day. Using gym bro math, that should mean at least double the gains, right? Surprisingly, the growth was pretty much identical. But now let's really push it. 270 grams per day. That's six chicken breasts. Well, despite participants in this study eating three times more protein, they actually gained less muscle. But I know what you're thinking. Jeremy, you can't just cherry-pick studies and call it a day. And you're right. So let's widen the lens a bit. Here are all the studies in the analysis that looked at moderate to high protein intakes, with just two outliers removed because it reported way larger than normal gains. Now, if eating more protein really has a powerful effect on growth, you'd expect these dots to climb up and to the right. The trend is basically flat. And so what that means is the anticipated benefit of pushing your protein even higher is very, very small. And frankly, so small that many researchers aren't even confident that a benefit exists at all. That's Dr. Eric Trexler, a published researcher at Duke University, who spent his career studying muscle growth. If you're building a house and you have more bricks than the blueprint calls for, that doesn't mean you end up with a bigger house. Basically, you just end up with a bunch of leftover bricks. And eventually, you're going to have to haul them away from the construction site. So when you're building a house, that's tedious. It's a waste of time. But graphs are one thing. Let's say you somehow managed to convince a pro bodybuilder to not just cut his protein intake in half, but to stop eating meat, eggs, and fish, getting all of his protein only from plant-based sources. Surely, he would shrivel up and lose all his gains, right? Well, that's exactly what pro natural bodybuilder Alex Leonidas did two and a half years ago. Alex used to eat 200 grams of protein every single day. Now, he eats as low as 90 grams per day. And all of it comes from plant-based sources. I've noticed absolutely nothing. Recovery is exactly the same. Progressive overload is the same as it's been for many years. I would consider myself an elite natural lifter. I've been documenting all my training since 2020. I have SD cards filled to the max. My gains have not been affected whatsoever. I've tried up to 220 grams, including being a single-digit body fat. Comparing that to 120, which is 100 grams less. I'm just as strong as I've ever been. 405 bench at 181. So if you're wondering how far a person can possibly get with a low-protein diet, Alex is living proof that the answer is pretty damn far. I just feel like people need to focus more on their health instead of just one sole macronutrient, protein. And I'm not the first person to report this. I don't know if you if you've looked at Brian Bornstein and a couple other guys, but it's a common thing that they're now dropping their levels to around the zone that I'm talking about. And that's been surprising to me too, because now I'm saving money and I don't have to stress about it as much. But now you're probably wondering, if protein doesn't matter as much as we thought, then what does? Well, let's take a look at a few clues. In one study, researchers had one group of people double their protein intake to about 140 grams a day, while another group stayed at 70. The catch? Neither group trained. And after 8 weeks, guess what happened? Nothing. No muscle, no strength, no gains, just more expensive pee. On the flip side, another study looked at patients with kidney issues, who were forced into extremely low protein diets, less than 50 grams a day. Now you'd expect that would completely shut down muscle growth. But when half of them started lifting weights, even on that tiny amount of protein, their muscles still got over 20% bigger and 30% stronger. But what about your diet? What if I told you eating this bowl of rice could get you the same muscle growth as eating all this extra protein? Well, in one experiment, researchers split lifters into three groups. All of them followed the same lifting program. Group A got nothing extra, just their normal diet. Group B added a 2,000-calorie shake made mostly of carbs. And Group C added a similar 2,000-calorie shake, but with 82 grams of protein mixed into it. After the 8 weeks, both shake groups gained significantly more weight and muscle than the control group who didn't get extra calories. But here's the kicker. The carb group experienced similar gains as the extra protein group, suggesting it was the extra calories, not the protein, driving the gains. And we see the same thing in the opposite direction. In fat loss studies, people who train hard and eat plenty of protein can still build muscle if they're at maintenance calories or in just a very small deficit. But once that deficit gets too steep, around 500-700 calories per day, most people start losing muscle, even with a high-protein diet. So you put all these studies together, and the most important drivers of growth becomes quite obvious. Number one, hard training. Number two, eating enough calories to fuel your training and recovery. And unless you're severely restricting it, protein actually comes in for support at number three. In fact, there's even some cases where protein can actually start hurting your growth rather than helping it. For one, protein is arguably the most filling food you can eat, and it also burns the most calories to digest. If you struggle to gain weight, this can make it harder to eat enough to grow. Not to mention the GI discomfort and flatulence that can come from higher-protein diets. You're not going to like it, and neither will the people around you. Second, it's expensive. Let's say your body only needs about 100 grams of protein a day, but you decide to push it up to 200. That extra 100 grams isn't giving you any additional muscle. Your body just burns it for energy. Now, if that extra protein is coming from chicken, that's about $5 added to your grocery bill every single day. But if you replace those calories with carbs, like potatoes, you get the same amount of energy for less than a dollar. That's a difference of around $120 a month, or nearly $1,500 a year. And third, when protein takes up too many of your calories, it pushes out carbs and fats. Too low fat can mess your hormones, whereas too low carbs drains your glycogen, tanking your workout performance. Now, I'll share exactly how much protein I'm currently eating, and the ranges I'd recommend at the end of this video. But just because protein is overhyped, it doesn't mean it's useless. There's actually three situations where protein has major benefits. First, although you can still build muscle without very much protein, the analysis that I showed you earlier, it does suggest a meaningful bump in gains when you go from very low protein intakes up to moderate ones. In fact, Alex mentioned that once he starts going below 90 grams of protein per day, his muscle recovery becomes noticeably slower. This threshold is right around 0.55 grams per pound of body weight. So if you take the number of grams of protein you eat in a day, and you divide it by your body weight in pounds, and the number that you get is below 0.55, you'll almost certainly see more growth by eating more protein. The second scenario is when you're dieting. We often talk about how protein can backfire because, you know, it has such a satiating effect, it can reduce appetite, but that becomes really a big game changer when we're dieting down, right? So being able to attenuate hunger and increase fullness on a high protein diet becomes really helpful when we're trying to lose weight and restrict calories. Now, if you're over 15% body fat, you know, you've got plenty of stored energy, so you don't have to worry too much about cutting into muscle as you're losing weight. But once you start to get below 15% body fat, protein becomes extra important. We recently published a meta-analysis specifically on lean dieting people and found that their protein needs tend to be a lot higher than we would typically see in people who are either not dieting or not quite as lean. And the third scenario is adherence. Some people just enjoy eating protein. I'm Filipino, and for me, rice without some kind of protein on the plate, it just feels incomplete. And that's also why I still use protein powder. I even sell my own brand, and while this video probably isn't the best marketing for it, I still use it almost every day. Not because it's magic, but because it's a quick, tasty, and versatile way for me to get 30 grams of protein in just a single scoop. But let's get to what you're actually waiting for. How much protein should you actually eat? So, for the majority of lifters, eating 0.55 to 0.63 grams per pound of body weight will already be close to maximizing your gains. For a 160-pound person, that would be around 88 to 100 grams of protein per day. And remember, protein sneaks into your diet in more ways than just shakes and chicken breasts. Bread, beans, peanut butter, it all adds up. I even scanned a simple meal with my app, just a protein shake and two slices of peanut butter toast, and that's already 50 grams of protein. So hitting your protein target could be as simple as adding one protein shake to your day. Now, if you do want a little extra insurance, you can go slightly higher to about 0.64 to 0.72 grams per pound. Think of this zone as very likely maximizing your gains. But if you're dieting and you're below 15% body fat, or let's just say you're somebody who wants the reassurance that you are definitely maximizing your gains, then you can bump this up to 0.73 to 1 gram per pound of body weight. As for what I'm currently doing, I used to sit at well over 1 gram per pound of body weight per day because I just thought it was necessary. These days, I'm actually closer to 0.73, right at the lower end of this maximized range, and I notice no differences in my gains. If anything, shifting some of those calories towards carbs instead has made my training as well as my digestion feel a whole lot better. Plus, I used to panic about protein whenever I travel. Now I know that even just one protein shake and a high protein dinner, that's pretty much covering my bases. So next time, before you buy those overpriced protein snacks, maybe buy a calculator to figure out how much protein you actually need first. Or you can just use my Built With Science Plus app. It shows you exactly how much protein you need and the right workouts to combine it with. Plus, it adjusts your plan based on how your body is actually responding. You can try it for two weeks completely free by scanning this QR code or heading to builtwithscience.com. But since your training is what really drives growth, highly recommend you check out this video next, where I break down the only two exercises you need for a wider back. Thank you so much for watching and I'll see you next time.",
    "created_at": "2025-12-17T21:31:44.622892+00:00"
  },
  {
    "podcast_id": "yt-EiPYgiu8-Hc",
    "transcript": "We've been talking about AI's impact on the workforce for a while now, and I feel like everything I'm hearing is just kind of anecdotal. Obviously, there are fewer junior roles and more senior roles and just a pile of resume crap that we're all going through, clearly. But we haven't seen real numbers to prove it. That is, until now. Harvard just commissioned a study to figure this out, and it's very, very good. I took the time to comb through it and read some of the responses to it, and what we have to learn from this is actually really cool. I first saw this on LinkedIn, and the diagram says it all. The amount of junior roles available is clearly going down, while the number of senior roles available is clearly steadily going up. This isn't just a few companies, either. This is across 250,000 firms that they have been actively researching to figure out what the impact is here. So what's going on? What can we learn from it? Where is the industry going? And most importantly, how can we actually get a job and make sure we become senior enough to not be unemployed in the future? These are all really good questions that are going to take a little bit to answer, and if I can't get a job, someone's got to pay me. So quick word from today's sponsor, and then we'll dive in. I love my current stack. It's made life way easier for almost everything I'm trying to build. The combination of things like Next.js and Convex just lets you ship really fast. But I find I still hit the same two roadblocks on almost every project I try to actually ship to production. Authentication and payments. I don't know how these problems are as annoying as they are, but I'm so thankful today's sponsors actually found a way to solve both at once. Yes, Clark did it. I am so hyped that billing is now part of Clark. It just makes so much sense. Subscriptions should be tied to a user. They shouldn't be part of your application database, the same way I don't think your users table makes much sense in your AppDB either. And having this split up this way has just made things so much easier to set up. I know Clark well enough to know they'll be okay with me plugging in an alternative. Here is my Stripe recommendations doc, where I break down everything I've experienced fighting Stripe constantly with T3 Chat. And as you see, it's a bit of a long document. And honestly, I need to update it because we've been hitting many more issues with T3 Chat. I've been slowly going mad. So you can do that. You can work with people like me to figure out how to get Stripe working just right. Or you can click a button in Clark. Like, let's be real here. The experience with Clark is so good. You set up plans in the dashboard. Now users can just check out all of the UI already built for you. All of the integrations already built for you. No webhooks. No managing event queues. None of the chaos that you normally have to deal with. And if users need to be able to unsubscribe and make changes to their stuff. Thankfully, Clark's already built components for all of this. Not just the payment side, but the user auth side. They have components for signing up and signing in, obviously. But they also have the little button in the corner with your ProPick with the menu that, oh, it's so annoying to build these things yourself. I've had to do it recently. It was not fun at all. Every time I don't use Clark, I end up regretting it some amount. Especially now that we have all of the billing stuff and the, oh. You're trying to make your app production ready and you're tired of dealing with all this stuff like I am. Look no further than Clark. Try them out now at soya.dev.link slash Clark. Quick overview of this study before we go too deep. This is a study on seniority-based technological change. Comparing junior and senior workers across different types of job roles, by the way. This isn't just for developers. This is across various types of employment. I wanted to make sure the numbers I had were good. So I went and found another study that has even more information. And what I found from this is even more concerning. Here is headcount over time by age group for software developers, normalized. This is data they're getting from ADP, the employer payment system for doing payroll for your employees. They've got abstracted anonymized data that just has the job role, the age of the employee, and the amount of money they make. And what you'll see here is that early careers, between 22 and 25, has been consistently going down. Meanwhile, 26 to 30, slightly down, but still relatively even. But 31 up, all of these groups are continuing to grow as part of the workforce. This is terrifying. And it very clearly starts right as AI perforation was, like, becoming a bigger deal. It's a very clear trend here. And if you wonder why the numbers are so low here, that's all COVID surviving. Like, during the COVID era, a lot less hiring was happening, and we slowly recovered from that. But then once we hit the AI boom, only the more senior roles and mid-career people were seeing that level of growth. Everyone else has been seeing less and less. These are some more fun numbers. These are firms with their first AI posting, so their first roles that mention AI in the, like, job descriptions. And the number of roles that have it mentioned, number of companies that mention it, is consistently going up. Left is the first time they do it. Right is ones that have done it at all cumulative. So you can see it's pretty consistent growth there. And here's where we see those differences in senior versus junior role availability and hiring. This sudden acceleration might have shifted firms' expectations about future automation, prompting them to adjust in a forward-looking manner by reducing junior roles that they anticipated would be automated in the near future. Such primitive adjustments could be optimal for firms if they view slower hiring as less costly than future layoffs. Yeah. One other thing of note in terms of cost, and this comes up in here, people seem to think that this is going to be, like, companies just trying to save money. It's not. Labor market adjustments are visible in employment more than in compensation. So the amount of money people are making isn't changing the same way. In fact, for seniors, it's actually going up quite a bit. But for more beginner roles, there's less roles. The change is in who is being employed and what levels they're employed at, not in how much money is being paid to people. So I want to be very clear. What's going on here is not any of the following. This isn't companies hating juniors. This isn't senior devs pulling the ladder up behind them. And it certainly isn't companies trying to pay people less money. Surely all of these things are things that have happened at times for reasons. But if you act as though this is why everything is going differently and why juniors are struggling to get a job, you're too busy raging to pay attention to what's going on. And I want to make sure that anybody who is currently struggling to find a role is not getting into this, like, delusion hate train that's going to just distract you from doing anything real. Another thing, and I don't like touching on this because it makes everyone's brains fall out. This has nothing to do with immigration at all. If you legitimately think the reason you can't get a job in tech in the U.S. right now is because of immigration and you live in the U.S., just hit that X button in the tab. My channel's not for you. We're here to talk about how to actually get jobs and actually be involved in the environment here. Like, a couple thousand H-1B workers have nothing to do with the fact that companies aren't hiring straight out of colleges anymore. This is a different thing we're talking about. This is the real world. So go off and do your racism somewhere else. We have real work to talk about here. Anyways, what's actually happening here? We're going to go a slightly different angle. I have hired a lot of people. I have done over 500 interviews at my time at Twitch. I have built, destroyed, and watched many teams and organizations change across Twitch and AWS accordingly. I've been through it with hiring. I've seen it on every side. I've interviewed at dozens of companies. I've hired for dozens more. I've done a lot with hiring. So why would you hire a junior? There's a couple reasons. The first one, I'm sure plenty assume this is the main one, juniors are cheaper than senior engineers. Why would you spend all this money on a senior engineer when you can get a junior? We'll get into that in a minute. There's a bigger one that's similar, though. They're more available. There just aren't as many senior engineers on the market because to become a senior engineer, you have to have a job. That's how you level up into the role of senior. So there's a much better chance if you're a senior engineer that you have a job than if you're a junior engineer or if you're fresh out of college. As such, there's a lot more juniors available on the market, which is why it makes sense to hire them if you're struggling to find more senior people. I know for a fact there is a real big struggle to find senior engineers right now. That's why we see all this crazy poaching culture where people are getting bought out and like hired off companies or companies are being acquired entirely to find good, capable engineers because there are not enough senior engineers for the amount of roles that are currently available. That's just a fact. There used to be not enough engineers, period, for the amount of roles available. We had a culture where a company like Google would hire a bunch of great engineers and give them nothing to do just to make sure their competition couldn't have those same engineers. We are way outside of that world now, but it's a culture that's still deeply ingrained some amount. I know I and many others were sold this dream of go to school for CS, get a job at Google, and live a happy life with the coolest workplace in the world. You even get free lunch and dinner. That's not what we're here to talk about. That was a promise we were sold that no longer exists. So what's the other reason to hire a junior? We're making a bet. Most junior engineers will eventually be pretty good. Some junior engineers will eventually be really good. Some of them will get there really fast, but a lot won't. A lot of junior engineers will slowly get good enough at one piece of tech and just kind of stay there. I've seen a lot of my own peers from college get into this, where they just kind of learned Rails in college because that's what they saw people were using. Didn't like it. Didn't hate it. Didn't build any side projects. They just kind of used it for their courses, and now they just kind of use it, maintaining an old code base, making 65, 70k a year. No chance of a promotion. No chance of a new role. They're just kind of sitting there, and they're fine with it. That's not a bet a lot of companies want to make. Meanwhile, if you're interviewing somebody from, like, my community, there's a good chance they're slightly more driven than average. Like, if you're watching videos about tech and you don't even have a job in tech yet, if you're trying to keep up with the industry, what cool technologies exist, what frameworks people like me are using, if you care enough to, like, be in the weeds like that, there's a real meaningful chance you're going to be really good eventually. And if you can detect this in interviews, you should potentially hire for that, because you're investing in the likelihood this person becomes really good. To be very real with you guys, if I was to take a junior eng and a senior eng and give them both a workplace with no external influence, like, I'm not mentoring either of these people. I'm just putting them on a project and telling them to do it. The junior would get about 25% of the work done. It would take them way longer, I'll say 3x plus longer, and it'd make 100k a year. This is just very general numbers from my own experience. Senior would be like 100%, so just standard speeds, 1x, 240k a year. So if I wanted to keep up with one senior with juniors, I'd end up with four of them. Now I'm paying four people 100k a year each and benefits and everything else. The liability of every individual employee is kind of nuts. Or I could pay one person 240k a year. No one's actually hiring juniors to save money unless they're not doing actual fucking work. And to be clear, this side is still worse than this side for many reasons. You will need a senior to manage this group. The real reason that companies are hiring junior devs isn't so they can lead shit themselves. It's in hopes of helping a senior do a better job of breaking their work up in a meaningful way. These are the actual reasons that you're hiring juniors. To multiply the force of your seniors, to train up new seniors, and to find incredible talent in a world with too little. It's hard to find great engineers, and you're kind of making a bet when you invest in a junior engineer that they can be trained, that they will be productive, that they won't slow down your seniors too much to justify their hiring, and that long term the company will benefit greatly from it. I was too junior to be hired when I was hired at Twitch, which is why I got a contract, not a full-time offer. In that first year, I had to grind a lot. For the first few months, I struggled immensely. My manager sat down and gave me better work. Didn't really mentor in the traditional sense where he handed me through line by line in the code, but just threw shit at me. He was like, here's how I did it. Go figure it out. And I would. And I learned really fast in constant fear of losing my job. And I didn't. I succeeded. I made it in. And then I like to think I had a pretty positive impact on Twitch. I just hung out at TwitchCon and had a lot of engineers tell me that they're still working on things that I helped get started. Yeah. So with all of this said, what is the role of AI? Because I still need more senior engineers. We still really want to train these people up. We're still hunting for this incredible talent. Why wouldn't we still hire juniors? Well, I personally would if we were hiring right now, but we're not. I do have one intern who's finishing up high school right now who just kicks so much ass we had to bring him on. But honestly, he's more senior than half the senior engineers I've talked to despite being 18. Yeah, I wrote him quite the college letter of reference because he should be. Yash is going to rule the world someday. That aside, why would this stuff go away? The harsh reality is there's a certain type of brain rot that exists in most fields, especially employment in these fields. More engineers equals more output. The Mythical Man Month was a required reading when I was in college, and I would argue it should be a required reading for most software developers. It's a book on software development that observes a pattern where more men does not make more software. As you add more people onto a project, the speed the project iterates actually goes down, not up. I just realized there's dark mode on Wikipedia now. That's cool. This book was written by Frederick P. Brooks when he was working on OS 360 at IBM. He added more programmers to a project that was behind, thinking that he would be able to get it back on track, and that was not the case. It actually got slowed down even further. There are certain tasks that just take a certain amount of time, and more engineers do not magically make it faster. Sometimes they'll even make it slower. Can you produce a baby in one month by getting nine women pregnant? Yep. This is the way this works. More engineers does not actually equal more output. There's a lot of reasons for this. The biggest one by far is coordination. It's hard to coordinate a bunch of different people, especially people you haven't worked with before, especially if those people work in different ways. In my video about all the chaos of acquisitions that OpenAI has been doing, I talk about this a little bit, and why it makes sense for a company like OpenAI to do an acquisition of a small team. Getting a team of people that already know how to work together is so valuable, because the hardest thing of management is understanding how different people work, and trying to coordinate it all so they can properly work together, and also making sure you're not rude to anyone at any point. They're not rude to each other. They're not causing more problems than they're solving. The orchestration of people is by far the hardest part of large software projects. And if you're a junior engineer that's in college right now watching this, or just got out and is trying to find their job, you do not know how hard you are to work with. Not just because you haven't had the job, but because you don't have the experience to know what good to work with is. It's hard to do. It's a thing you learn over time, how to be a good co-worker, how to actually get shit done at your job. And no one's going to have that fresh out of college. As such, when I would manage juniors, I would have to find for all of them what's their way of working and learning. How much of this is just ingrained in them and won't change? How much of this can I shift towards a more ideal collaborator, a person to work with on my team? How can we make this work together? How can I solve the puzzle pieces and grab some scissors and trim some edges to make everything fit together? This is not easy work. I know that tech managers and PMs and all of this get a lot of crap, but their work is not very well respected. It's not easy to run a giant team of people and make all of this happen in real work environments. It just kind of sucks to do. There's a very good chance if you're managing junior engineers for the first time, you're going to hurt someone's feelings. You're going to make someone real upset. You're going to cause a project to be way slower. You're going to make someone work too many hours accidentally. You're going to do a lot of things that suck. That's just the nature of management, the nature of learning, the nature of all of these things. Do you know where none of the things I just said apply? Claude. Claude doesn't give a fuck if you're rude to it. Claude doesn't give a fuck if you make it work 100 hours in a week. Claude doesn't care about who else is working with and how you treat them differently and the difference in salary of like 5k a year between people. I cannot tell you how many fucking great engineers I have had to talk out of leaving behind an incredible role with an incredible team for a questionable role with a team they don't actually like for a $5,000 a year difference. I'm sorry, a 5% bump in your salary is not worth upending your fucking life for. And this shit, it just, these are the things you deal with when you're talking to these early engineers. And it sucks because none of this is making your company better. Trying to explain to one of my junior engineers why they shouldn't be so upset about a 3 to 5% difference in salary when they could just be growing their career 3 to 5x. Trying to explain to somebody why they have to get their tickets in in time and why they do actually have to go update JIRA. Otherwise, I can't track their work. All of these things aren't the core role that I have, which is to deliver software as an engineer or engineering manager at the company I'm working at. This shit just gets in the way. Claude doesn't care. This is the catch. If you take two good managers, not great, good managers, you give one a team of four juniors and they have to teach these juniors how to work in the environment. Or you give a good manager four instances of Claude code. It's going to be much quicker for the person with four Claude codes to get productive and ship really fast than somebody who has four junior engineers that's a good enough manager. If you're comparing great managers, the person with four people will quickly do very well. It'll take some out of time. Like, they'll be unproductive for a month or so. But then once everything's aligned and they figure it all out, assuming the juniors are good as well, they can get moving really fast. And you'll be pretty hard capped at the ceiling with the guy with Claude code. But here's the harsh reality. Most managers aren't great. Most managers aren't even good. Most managers are pretty bad. If you take four junior engineers and multiply them by one bad manager, you get zero. You get jack shit. If you take a bad manager and you give them four instances of Claude code, they'll at least be productive. Like, they won't be good, but they'll be productive some amount. And when you're making your processes for your companies, especially these big companies, you got to plan for the bottom because there will always be a bottom. We break this down to great, good, and bad. If a great engineer using Claude code is 80% as effective as a great engineer with a real team, a good engineer is going to be 120% as effective with Claude code as they would be with a good team. And a bad manager is going to be 200% plus more effective with Claude code than with four junior engineers. And when you see this on a spectrum of good to bad, optimizing for the bad managers makes a lot of sense. And it sucks that this is reality, but it is. But there's a scarier reality, too. Where did the great people come from? How do we get these great engineers and these great managers in the first place? What leads to these people getting good enough that they can run a team well, they can get them really productive, and they can get them shipping and growing and into these more valuable roles? What makes an engineer good enough to lead a team of people to greatness themselves? I'll give you a hint. It requires that they have a job and learn from somebody else who's already done it. Okay, yeah, that's the answer. You need to work with people who have already done it. It is really hard to get better when you can't see what better is. When you're surrounded by engineers of various skill levels, it's hard to even know what your skill level is. One of my favorite sayings that's haunted me my whole life is that if you're the smartest person in the room, you should leave the room. You don't get smarter by surrounding yourself with dumber people. You do get smarter by surrounding yourself with hard challenges and smart people to pace yourself with as you figure it all out. That's one of the reasons I love college. Not because everybody in college is way smarter than you, but the fact that you can pace yourself alongside these people helps you level up a ton, and it gives you the motivation to keep pushing. If you have even smarter people around you, maybe some peers who are smarter, maybe a friend who's already employed, maybe a senior when you're a junior, that when you become a senior, goes and gets a real job and tells you all about it, maybe some people you meet at a hackathon, maybe one of your professors is actually good, God forbid, any of these things, that's what makes you grow. It's really hard to do this in isolation. And this is the point that I am most scared of. I wish I could sit here and tell all of the juniors, all you have to do is go make a project on GitHub or contribute to some random open source project and everyone will see how smart you are and you can get a job. It never quite worked that way, but now more than ever, it absolutely does not work that way. You need to be near people who are smarter that you can learn from and grow from. And that's really hard to find right now. That's what these numbers are showing that's so scary. These 22 to 25 year olds are the people who should be surrounded by smarter 35 to 40 year olds and can learn from them and grow and improve their skills. That's how I got better. Once I got hooked to getting better, my role in this place changed a ton where it was less me going to just learn from them and more me going to share the things I love that I learned about that I was inspired to go learn about because of them. I was the guy who was always into the new shit and would come to the office excited to talk about Svelte 1.0. I was called the Svelte guy at work even though I've never ever shipped a project with Svelte because I thought what Rich was doing was really interesting. And I would talk with much smarter people about it and learn different ways of thinking about it. And I'm scared that's going to go away. And I don't know what we replace it with. As you level up in your career, it gets harder and harder to find rooms where you're not the smartest person or at least the most senior person. Even for me, now that I'm like 30 and in SF, I often find myself in a room full of 20-somethings that are grinding hard doing awesome stuff. They are smarter than me in many different ways. But I am often the most senior engineer in the room now. And that's weird. My whole career, as far as I can remember, my thing is that I was the guy who was too junior to be there but could somehow keep up. That's over for me. But I'm also only 12-ish years into my career. I know 12 years is a ton of time. But the fact that I'm struggling to find rooms, find workplaces, find places I can go and contribute where I'm not the most senior person is a little bit scary. And I'm so lucky to be in the position I'm in where I have incredible people, my literal idols from my childhood when I was learning to code. People like Ryan Carniato, Fred Schott, Tanner Lindsley, a bunch of the core React team people that hang out all the time. People like Naman who was just in chat earlier. So many of these people who I am so lucky to even know the names of, much less be able to call my friends. It's awesome I have those people so I can continue to be the dumb one in the room. But it's hard to find that. And if you're not as fortunate as I am to have these connections with incredible people because for some reason people watch your YouTube channel. By the way, if you don't mind, hit that sub button. It costs you nothing. It's free. The red button underneath. Less than half of y'all are subscribed. Come on, guys. I've heard that people who subscribe to my channel are actually 2x more likely to get a job. I don't know. Just a thing I've heard. Regardless, I'm lucky to have that and that's my angle to meet these awesome people. But if I didn't have the job or the channel or all the connections in the VC, Y Combinator, Silicon Valley world, it would be really, really hard for me to find these types of people and to keep learning and growing. If I was me 10 years ago fresh out of college, I don't know what I would do. I had my friends in college, my open source friends, and I learned from them a bit. But it's not the same as every single day going to an office and being in meetings, being in a line of desks with people that are better than you, that you can learn from and grow and go out of your way to try and meet the bar of. And I don't know how we replace this. At the very least, we need college programs to get a lot better. Because right now, we've just accepted the fact that college programs for learning how to code are shit. That's just been the norm for so long now that we don't think twice about it. Obviously, someone comes out of college and doesn't know how to use Git. What? That's so insane to me. And I've seen people coping and arguing like, yeah, Git is a new technology. It might change. No. Just be fucking realistic. College programs should teach you how to work in a real environment and learn from smarter people. And the worst part is when you are one of the smart people, if you learn to code before college, you're going to spend the entirety of your college experience being the most senior person in the room. It's relatively easy for someone who learned to code in high school to show up to college and understand code better than most of their professors. I've seen this so many times. It's painful. And then once you finish college, having been smarter than your professors, basically doing jack shit for four years, all the things they were supposed to teach you in college you already knew or just didn't care. You come out at the end. You don't have any peers that are at your level. You don't have any projects that are built by you and a bunch of other smart people. You just come out having kind of wasted three to four years. What do you do now? How do you explain to a company that you're a real engineer and the other 600 people in your class aren't? Hackathons seem to be a cool-ish thing for this, for sure. But the really important thing is to make friendships and connections so that you can get good people. In the end, hiring always comes down to the same one thing. Trust. You are constantly exchanging trust for money in the process of hiring. If I have the option of a somewhat senior engineer that worked for two years at, I don't know, some company like Shopify or Netflix or something, or somebody that hasn't had a traditional job yet but I worked with on a hackathon project or I saw contributing to an open source thing that I care about, one of these people is much easier to trust than the other. Someone's career history is a useful metric for how trustworthy they are and how capable they might be. But somebody who you've worked with in the past that you know can contribute and be useful, that's a much easier person to trust. And previously, we were willing to take bets on low-trust individuals, the people fresh out of college, because if that went well, we'd have a great engineer. And if it didn't, we filled the seat, got some work done, and can just fire them and get the next person. But the reason we dealt with that is the need for engineers was so high. Now the need isn't just going down. It's a counter-signal in many places. If a good manager is slightly more productive with Claude than they are with a team, and a bad engineer is much more productive with Claude than with a team, the incentive to take the risk is going down. Without taking the risk, we never see the other end. We don't get people who we made a bet on that had a 20% to 40% chance of becoming a great engineer and maybe even a great manager someday. If we're not betting on these people, we won't see those success stories in the future. And there's a world where the next Theo just never happens, or just does YouTube and nothing else and never actually gets good. I can't imagine if I started the YouTube channel before having my 10-plus years of industry experience, how this would all come off. It'd probably be much worse and much more terrible advice. Sure, people meme all the time, Theo's a soyboy JS dev that just so happens to have scaled services to hundreds of millions of users. That's a side thing. We don't pay attention to that part. We're too focused on him liking and defending JavaScript sometimes. Really though, I'm one of the few more senior engineers doing this type of content. And if there are fewer senior engineers, there are going to be much fewer people like me doing this type of content. Especially because the value I can provide to a company is going up every day. There's a future where a company offers me so much money that I effectively have to stop doing YouTube because it's irresponsible to do both. And all of a sudden, this resource goes away. Will it be filled? Maybe. I like to hope that markets work in such a way that this channel can make enough money to be an alternative to writing code for somebody who knows enough about both. But there wasn't really much before me. And I'm scared as shit there won't be much after. I'm not saying there aren't other great channels that you can learn a bunch from. But the balance of real experience, practical advice, decent production. Thank you, FaZe, for carrying my ass. And just caring way too fucking much. That combo just isn't very common. And if we reduce any of those numbers, especially if we reduce the number of engineers that have the opportunity to level up and grow and get good. The likelihood of more people doing content like this. The likelihood of good managers hiring people. The likelihood of good mentors that would pick someone like me, make the bet, and help me find my success. It's all going down. And that's terrifying to me. I try to end on a good note with these. And it's harder than usual. But I'm going to lean into this trust thing a bit more. Because in a world where everyone's just peddling AI slop, the need for more trust is higher than ever. There is such a vacuum of trust right now in the industry. Our programs are no longer deterministic because we have LLMs generating random shit all over them. The fact that we're shipping actual production services with like 85% reliability is absurd to me. As such, being real, transparent, reliable, and accessible is more valuable than ever. The thing you need right now is a friend. Not a job. Although a job would be nice. And I wish we could all get them if we deserved them. It's harder to do without having connections. Without having people who trust you. Without having connections. Without having a network of people who are in this world already. If you're the best programmer you know, you're fucked right now. You're absolutely screwed. You should be friends with people who are smarter than you. You should surround yourself with people who are more competent and capable than you. You should be a chaotic lunatic like Barrel of Lube on Twitter. I'm not saying you should make a Twitter. If you do, you should do it like he does where it's impossible to ignore the shit. But you should find people who know more than you. Who are excited about the same things you are. Because they might be lonelier than you think. You would be amazed how many smart engineers there are that just don't have anyone to talk about this shit with. That's why this whole channel was made in the first place. I made this channel because I wanted to nerd out about deep tech stuff that I couldn't anymore. Because COVID took away my lunch and dinner conversations. When I couldn't force my coworkers to listen to me rant about Svelte, I needed to do it to somebody. And I picked my friend in chat, Jacob Evans. He had a Twitter space called Code and Life that he would do every Wednesday, Thursday, and Friday night. And I would go there and just take over the space with my 50 Twitter followers. And rant about whatever I was interested in at the time. One of those things with a T3 stack. And people didn't understand it. So I went live on Twitch to showcase the T3 stack. And decided, yeah, why not. And I went and uploaded it on YouTube. That went way better than I ever, ever, ever could have expected. And here we all are. It's kinda nuts. I miss the OG Twitter space era so much. That was a great way to make connections and network. But in the end, this all just comes down to being fucking useful. Being interesting. Being in the space. Being a name that can be recognized and being trustworthy. And here's how many connections I've helped make. And how many job roles I've helped fill. Because I saw the right person reply to something on Twitter. And I'm not saying Twitter is this end-all be-all method for getting a job. It's actually one of the worst ones. GitHub issues are great though. If you're on GitHub and you're using open source projects. And you see something that you use. Like, I don't know, Next.js. And you have a problem with it. And you find an issue where the problem is described. That hasn't been updated for a few months or a few years. Drop a link for a repo that makes it easier for them to reproduce it. And possibly fix it. Just drop a, hey, I tested on 16.0.1. It's still broken. Here's a small reproduction I made on CodeSandbox or StackBlitz. That makes it really easy to see the problem. Those little things. If I see your username popping up in valuable places. Where you're clearly actually working. And finding real problems in the real world. I trust you a hell of a lot more than some overly credentialed fucker. That's giving me a crazy AI-generated resume. The reality is. I don't trust you. I don't trust you. I don't trust you. I don't trust you. I don't trust you. I'm not going to give you that AI-generated resume. The reality of trust is you're not going to get it from your fucking resume. You're not going to get it from cold applying to shit. You're not going to get it from a bunch of random GitHub repos. You get trust by doing real shit with real people. I've seen so many engineers that only talk about the people side. When they're complaining. And not when they're growing. You can't skill up your way into a job anymore. You barely could before. You can't resume boost your way into a job. When you're in a job. You can't resume boost your way into a job. When you're in a pile of 10,000 AI-generated resumes. You can't just apply to a listing. That gets hundreds of applications a second. And expect anything to happen. When they have one role to fill. Especially if they end up giving it to a senior person anyways. You need to level up. By locking in. And finding real people. That want to do it too. If you are the smartest dev you know. You probably can't get a job right now. And that's terrifying. Not just for the industry. But for you independently. You shouldn't be the best dev you know. You need to go out of your way. To surround yourself with smarter people. And be interesting and useful to them. And that's not as hard as it sounds. If you find these people. You're probably finding them in spaces you're already in. Because you're interested. Lean into that. There are so many people that I love from my community. That I found because they drop useful resources in my chat. Or because they reply with funny things on Twitter. They started contributing heavily to Create T3 app. And now I've helped them get jobs. And now they're running companies themselves. Find people you understand that you align with. Do the things that you care about. That you think they care about too. And then once you're deep in the space. Ask them for advice for finding a job. One of my favorite quotes. I think I got this from Michael Seibel. But I've heard it so many times now. It's from many places. This is about investing to be clear. If you're looking for money. This is the rule for investing. If I want to raise money. I should ask rich people for advice on how to raise. If I'm trying to get advice. I should ask them hey can you give me some money. This is kind of how it works in this world too. I'm not saying you should come to me asking for a job. So you get advice. I'll just fucking block your ass. Stop coming to me asking for a fucking job. Your conclusion from this video. Is that you should DM me your life essay. About why you should be hired. You're entirely unemployable. You should ask the smartest people you know. In the space. The most employed senior capable engineers. That you're friends with. Once you've established a friendship with them. Hey man. It's kind of hard to get a job nowadays. I'm curious if you have any thoughts. On how someone like me could get their first role. And if you see that person is hiring. Don't ask for the job role. Don't ask for a referral. Don't ask for anything other than advice. If you see someone like me that you respect. You get multiple DMs back and forth. And you see them put up a job listing. Don't ask for it. Ask them for advice on how to get a job. You'll be way more likely to pull it off. There is nothing that smart people like more than feeling smart. That's why they do it. That's the whole reason. So if you give them the opportunity to feel smart. By giving you advice. They get more excited about the conversation. They have a more positive memory of you. They have more reason to want to talk to you. And respond to you. That's such a thoughtful way of putting it. Thank you. That pattern plays really well. And results in people thinking of you more. And even if they don't have a role open. You bet your ass. The next time they do. They're thinking about people who would be a good fit. What they're thinking about is people they know are capable. In the space they're already in. That make them feel good. You can hit all three by asking them how to get a job. I wish I had more advice here. I'll be honest. This is terrifying. Very good point from CJE. He's been dropping really good points throughout. The caveat here. Is it's really easy to smell. When someone's trying to game this. I am scared that by giving this advice here at all. I'm almost setting myself up for failure. Like the people who benefit from this. For the most part already knew to do this. And I'm scared if I give this advice. That a lot of people. Who wouldn't have figured this out. That would have just sent me the like. That I get dozens of a day. That person is now going to be more annoying. Because now they can disguise themselves. As a good intended person. It's similar to the open source contribution thing. I just did a video on. If it looks like a duck. And it smells like a duck. And it acts like a duck. It might be an imposter. Be careful. I'm really scared of that. That's a really good point on the senior thing. The reason I'm so scared about channels like mine not existing. Would be making a blog post. That even a handful of people read. Most of the time no one will. But even if they did. I barely get jack shit for it. Why would I? I already have a job. There are so many layers to why this gets bad. If all the educational materials. By people who don't know what they're doing yet. Then the next generation gets dumber and dumber. We're possibly living in idiocracy right now. And that terrifies me. My advice is surround yourself with smart people. And do your best to be better than you were yesterday. I wish I had better advice. Than make friends and subscribe to my channel. But those are the two things I've seen help. Maybe give them a shot. Wish I had more to say here. But this is the reality. The industry is changing. And it's changing most for juniors. Don't listen to random senior engineers saying everyone's fine. There is no change. Because they're not being affected. You're being affected. And that sucks. I hope this was helpful. It's a bit of a chaotic one. Let me know what you all think. Until next time. Peace nerds.",
    "created_at": "2025-12-17T21:31:44.709031+00:00"
  },
  {
    "podcast_id": "yt-LLwLv7nOymQ",
    "transcript": "One of the very fascinating turning points that I have been able to pinpoint, or at least I think this is what happened, is when do the first kings come up? They weren't kings for a very long time. The first king that I can identify was in the so-called Sumerian high culture, was in Uruk, was Gilgamesh, and they wrote the Gilgamesh epic about, you know, the great king. But that was four or five thousand years ago, something like that. But what happened in the thousands of years before, there's no source that there were rulers. It seems like humans were quite good in organizing themselves without kings before these first kings came. And I mean, thousands of years from the end of the Ice Age until the Sumerian high culture, there were no kings. So people were quite able to organize their communities. There was, for example, Catalhyk in eastern Turkey that was working for like 2000 years without any hierarchies. I think that is quite interesting. And then why do suddenly the hierarchy start and what makes the hierarchy stronger? And again, I'm still researching this, but in Sumeria, we can see that it's the beer that destroys the hierarchy-free society because beer is quite old. The first beer was made in Gbekli Tepe, the famous first kind of structure of mankind. I also write about that because it's very interesting. Small detail. What is Gbekli Tepe? No one knows. How did they make it? No one knows. But they made it. But why did they make it? I think they made it because they were creating a meeting place. And why was that so important? There were not so many humans at the time. There were like one to four million. Those are the estimates on the whole planet. And they were usually living in small communities of like 100 people up to 500, not more. So the problem then is again inbreeding. Inbreeding means it's a degeneration. So it's a problem. We are genetically not so diverse, actually, as humans. But Gbekli Tepe, people were meeting from different areas, having sex with people they usually wouldn't see, creating healthy children. And Gbekli Tepe was working for 1,600 years. And I think it was like an evolutionary kind of machine. Without that idea, we're going to create a fucking place or a party place. It was a party, basically. They were eating very well. They found a lot of bones. But no one lived there. They just came together there for parties. And then after 800 years, they start making beer there. And then the situation slightly changes. They found these places where they made beer. You can still find the chemicals and it's sure that they made beer there. And then once they make beer, they create different stone circles. And then somehow it changes. And we can see clearly how it changes in the Sumerian high culture when beer then becomes a business. Beer is being done by the priests, by the ruling class, or ruling class emerges. Monasteries often brew beer. And that was also the case in the Sumerian high culture. They make beer, they label the beer, like the temple that would make the beer, the beer would be attributed to that temple, it would be sold. So that temple kind of rises in status, makes money. So that's how hierarchies started up. So the hierarchy, which is the big problem right now that we have these hierarchies, that we have these kings everywhere that kind of steal our money, or at least make it very difficult for us as humans to organize on an egalitarian planetary scale, which is our only chance for survival. If we at one point overcome the hierarchies, overcome the nation states and create a planetary, probably AI assisted, open source AI assisted planetary society, and everyone has the same political rights, there's no more borders, there's a planetary minimum income, so no one is starving, everyone has at least what everyone needs, which is totally possible. It's just a problem of organizing and of breaking the resistance of those who don't like that. And there's a lot of resistance, obviously, I mean, I'm talking about what's happening on the planet in 50 years, not what's going to happen tomorrow, but that is where we slowly are moving towards. And you can see that this actually comes from a time when we were able to organize ourselves without kings, we don't need kings. Kings always say, if you don't have me, then someone else, some other guy will come. That's why I'm not, if a nation state makes war against another nation state, I'm not taking a position and saying this country is like better, basically, the both nation states are doing war and who has to suffer is us, is stone sapiens, is the human species. Transcribed by https://otter.ai",
    "created_at": "2025-12-17T21:32:30.164485+00:00"
  },
  {
    "podcast_id": "yt-M61oqDvNsN8",
    "transcript": "When I asked you before this conversation started rolling what you're really excited about at the moment your response to me was there was a few things but one of them which lit up your face was creatine. Yes and it's funny because it lit up your face again yeah it's it's funny because creatine has been around for I mean ever for decades and it's always been in my mind it was like one of those Jimbro things like I don't need to be swole yeah I don't need creatine to get get swole and you know this is this was the thought for for many many years and then over the last five years or so the effects of creatine on the brain start to really get my interest anything that affects the brain I really become interested in and so that's kind of what did get me the most excited about about creatine but also I started doing a lot of resistance training and so I was like okay here I am now I'm like one of those gym guys I'm doing I'm doing the barbells I'm doing the you know the squats and the deadlifts and all that and so so why not give myself some of the creatine well what is creatine right why is it important you talked about earlier you know why doesn't our body just make more of these things that are so beneficial we do make creatine we make about I don't know our liver makes about one to three grams a day of creatine and our brain also makes creatine and those are the two organs that make it creatine gets consumed by other tissues like the muscles probably the one that's the greediest because creatine is stored as phosphocreatine but it's used to make energy essentially so it can increase muscle mass it can increase muscle strength in combination with resistance training because you're able to regenerate and make energy faster so for example I became interested in it after reading studies where people that supplemented with creatine that were engaged in resistance training were able to gain more lean body mass they were able to gain more strength it was increasing their training volume so you can do one to two more reps right of whatever exercise you're doing and it seems to decrease the recovery time between those those sets as well so you're able to increase your training volume well anything that's going to increase your training volume is going to then have the downstream effect of you know increasing the adaptations like increased muscle mass or increased muscle strength I started supplementing with creatine about a year ago and I started supplementing with it for that reason for the my training and I was doing about five grams a day because that was really what was shown to to be beneficial for muscle health in combination with resistance training and it's important for people to realize that supplementing with creatine by itself without any type of resistance training isn't going to grow your muscle it's not going to make you stronger you have to put in the effort because what creatine is doing it's helping you make the energy quicker right and that and then being able to make that energy quicker means that you're able to then do that exercise better harder more of it right so it's sort of super charging your exercise routine and five grams a day was like okay perfect that's what I'm doing I'm doing five grams a day and definitely noticed an effect on my training volume where I was you know doing more more reps so that was like okay a year ago I had already been aware of the effects on the brain I thought maybe the five grams a day would do that so what are the effects on the brain well your brain also consumes a lot of energy you know needs a lot of energy so it does make its own creatine but it turns out if you can if you can give your brain more of that creatine particularly under a period of anything that's causing stress so let's say lack of sleep or let's say emotional psychological stress or in my case high cognitive load where you're just every day learning concepts complex things you're trying to remember them you're putting ideas together and coming up with new hypotheses and you know you're just you're just you're studying a lot and it's very cognitively demanding and it's it's a type of stress on your brain that's like my life right under this condition of stress depression is another one that's a stress on your brain or neurodegenerative disease that's a stress on your brain so any kind of stressful condition that's where creatine shines in the brain I would argue that all of us who has the perfect amount of sleep never has stress nobody right there's always some sort of stress in the background so that's when I was like okay so if you're the perfect person you have no stress you get the perfect amount of sleep every night your brain makes enough creatine to kind of do what it needs to do I know that I'm constantly under stress so I'm like okay well I think I need a boost and this is where a lot of very interesting studies have come out of many different labs some out of Germany that looked at the dose of creatine and how it increases creatine levels in the brain and this is why I now supplement with 10 grams a day so the study out of Germany found that five grams a day of creatine if you're supplementing with five grams a day your muscles are greedily consuming it particularly if you're working out they want it they want it after about five grams a day especially over a few months like you're you're saturating your muscle and that's enough right anything above that kind of spills over to the brain and so they what this German study found was that 10 grams of creatine increased creatine levels in several different regions of the brain and that was probably the most exciting you know I would say evidence that supplementing higher than five grams a day was actually doing something in terms of getting creatine into the brain there have now been a variety of studies that have looked at different outcomes right so if you supplement with 10 grams of creatine or even go higher than that like 20 grams of creatine how does that affect cognitive function right and so some of these studies have been done by Dr. Darren Kandow he's at the University of Regina in Canada and it's looked they've looked at things like sleep deprivation and it's been found that if you take someone and you sleep deprive them for 21 hours and give them about 25 to 30 grams of creatine it completely negates the cognitive deficits of sleep deprivation actually not only does it negate the cognitive deficits of sleep deprivation it makes people function better than if they were well rested that's where I was like wait a minute there's many times when I'm traveling I'm jet-lagged uh lots of times when I'm sleep deprived and I have to be doing a podcast or a presentation whatever and in those situations I go up from my 10 grams to more like 20 grams like today for example I wasn't really sleep deprived but you know there's a lot of high cognitive demand this is a long podcast there's all that stuff and so I went up to 20 grams today on my creatine and I well I will say even at the 10 grams for me we were talking about this with respect to being in ketosis I don't feel that mid-afternoon crash when I have the creatine not being on a ketogenic diet not being in ketosis it's very clear for me and I've done this where sometimes I only do five grams and then if I do that I'll notice I'm like why am I tired right now so there's something interesting and maybe it's placebo I'm gonna throw that out there very possible but I don't know maybe the creatine is again it's able to regenerate that energy quicker and so that's also beneficial for the brain and now I would say all these creatine researchers a lot of them are shifting to the brain it used to be all muscle focused and now people are super interested in what creatine is doing to the brain especially if you're supplementing with more of it and you know this is important for people that are under a stressful situation but also for vegans because creatine is found in food mostly in animal products like meat and poultry and fish dairy a lot of vegans don't eat that and I've had so many of my vegan friends I've got them on the creatine and it's changed their lives I mean they're like this is like incredible you know can you imagine someone who's not getting any creatine from their diet because they eat no meat and all of a sudden they start supplementing with five ten grams of creatine and it's like they have energy some people say they they require less sleep which is kind of interesting that's kind of a comment I've heard many many times from people is that it's like their brain doesn't need as much sleep they have more energy so I've been a big fan of the creatine not only for the muscle especially because you know working out is something that's very important but for the brain as well.",
    "created_at": "2025-12-17T21:32:42.475813+00:00"
  }
]
